cfd_interfaces/openfoam/examples/rectangular_wing/base_folder/0.org/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    sides
    {
        type slip;
    }

    outlet
    {
        type            zeroGradient;
    }
}
