cfd_interfaces/openfoam/examples/rectangular_wing/base_folder/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType laminar;