cfd_interfaces/openfoam/examples/rectangular_wing/base_folder/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 12;

method          hierarchical;

coeffs
{
    n           (3 2 2);
}
